Repository: vershininvi/sqtd
Catalog: po/*.po
Languages: ru

source: Reading
ru: Чтение

source: ... OK
ru: ...ОК

source: Error reading
ru: Ошибка чтения

source: Writing filename
ru: Запись файла

source: Checking configuration key
ru: Проверка ключа конфигурации

source: The squid access log file not specified
ru: Не указан путь к журналу доступа squid

source: Check interval is not specified
ru: Период проверки не указан

source: Log file is not specified
ru: Не указан файл журнала

source: No pid file specified
ru: Не указан файл идентификатора процесса

source: No sock file specified
ru: Не указан файл сокета

source: The SockOwner not specified
ru: Не указан владелец сокета (SockOwner)

source: The SockGroup not specified
ru: Не указана группа сокета (SockGroup)

source: The SockMod not specified
ru: Не указан режим доступа к файлу сокета (SockMod)

source: The SystemDomainDelimiter not specified
ru: Не указан системный разделитель домена и имени пользователя

source: The SquidDomainDelimiter not specified
ru: Не указан разделитель домена и имени пользователя squid

source: Adding limit
ru: Добавление ограничения

source: Can not add limit
ru: Невозможно добавление ограничения

source: There are two types of limit (g -for group or u for singe user))
ru: Типы ограничения (g для группы или u для пользователя)

source: Error in limit's period (h - hour,d - day,m - month), period='
ru: Неверно указан период ограничения (h - час,d - день,m - месяц), указан период '

source: Ignoring all other fields of limit
ru: Игнорирование дополнителных полей

source: Adding user limit
ru: Добавление ограничения пользователя

source: Adding group limit
ru: Добавление группового ограничения

source: The group is empty:
ru: Группа не содержит пользователей:

source: The count of user in group
ru: Количество пользователей в группе

source: Can not get the group ingormation
ru: Невозможно получить информацию о группе

source: Opening
ru: Открытие

source: Can not open '
ru: Невозможно открыть '

source: Reading configuration file ...
ru: Чтение конфигурационного файла

source: Skip comment line #
ru: Пропуск комментария

source: Skip empty line
ru: Пропуск пустой строки

source: Error adding limit in config file line
ru: Ошибка добавления лимита, строка конфигурационного файла

source: Error in config file line
ru: Ошибка в строке конфигурационного файла

source: Unknown key
ru: Неизвестный ключ файла конфигурации

source: Checking configuration...
ru: Проверка конфигурации

source: Error reading socket
ru: Ошибка чтерия сокета

source: Can not open config file
ru: Невозможно открыть файл конфигурации

source: Starting
ru: Запуск

source: Go to daemon mode
ru: Переход в режим демона

source: Can not start as a daemon
ru: Запуск демона невозможен

source: Opening pid file
ru: Открытие файла идентификатора процесса

source: Can not open pid file
ru: Невозможно открыть файл идентификатора процесса

source: Priting pocess identificator into the pid file
ru: Запись идентификатора процесса в файл

source: Set session id
ru: Установка идентификатора сессии

source: Changing working dir
ru: Смена рабочего каталога

source: Can not create socket
ru: Невозможно создание сокета

source: Can not calculate user traffic
ru: Невозможно рассчитать трафик

source: Reconfiguring sqtd
ru: Реконфигурация sqtd

source: Can not reconfig sqtd
ru: Реконфигурация sqtd невозможна

source: Waiting
ru: Ожидание

source: s
ru: с

source: Exit...
ru: Выход...

source: Calculating user traffic
ru: Вычисление трафика пользователей

source: Error reading record from access.log
ru: Ошибка чтения записи из файла журнала доступа squid

source: Wrong record
ru: Ошибочная запись

source: Can not open squid acces log file
ru: Невозможно открыть файл журнала доступа squid

source: Can not open log file
ru: Невозможно открыть журнал

source: Opening the file
ru: Открытие файла

source: Can not open file
ru: Невозможно открыть файл

source: Start from position pos:
ru: Обработка с позиции

source: The position is:
ru: Позиция :

source: The last read record :
ru: Последняя обработанная запись

source: The record at pos :
ru: Запись на позиции :

source: Starting read from begin of the file
ru: Обработка с начала файла

source: Usage:
ru: Использование

source: [OPTIONS]
ru: [ПАРАМЕТРЫ]

source: -c --config filename full path to configuration file
ru: -c --config filename Путь к файлу конфигурации

source: -h --help Display this usage information.
ru: -h --help Отображение справки.

source: -n --no-daemon do not start as daemon, output log to console
ru: -n --no-daemon Не запускать как сервис, выводить журнал в консоль.

source: -v --version Print version messages.
ru: -v --version Показать версию.

source: The more information about programm: man sqtd
ru: Дополнительная справка: man sqtd

source: Version :
ru: Версия :

source: options
ru: параметры

source: -i --interactive Ineractive mode.
ru: -v --version Показать версию.

source: -h --help Display this usage information.
ru: -h --help Отображение справки.

source: -l --light-mode Return OK on error.
ru: -l --light-mode Возвращать OK при ошибках.

source: -s --socket filename The sqtd socket file to connect (default /var/lib/sqtd/sqtd.sock).
ru: -s --socket имя файла Имя файла сокета (по умолчанию /var/lib/sqtd/sqtd.sock).

source: -d --debug filename The output debug info to specified file.
ru: -d --debug имяфайла Вывести журнал отладки в файл.

source: Enter command
ru: Введите команду

source: The avaiable commands is
ru: Возможны следующие команды

source: help - show this help
ru: -h --help Отображение справки.

source: config - show current sqtd config
ru: config - показать текущую конфигурацию

source: limits [USERNAME] - show limits for all or for one user
ru: limits [USERNAME] - показать ограничения для всех или для однгого пользователя

source: traf [USERNAME] - show traffic for all or for one user
ru: traf [USERNAME] - показать ограничения для всех или для однгого пользователя

source: user USERNAME - check user status (OK -can access , ERR -can not acess)
ru: user USERNAME - проверка статуса (OK - доступ открыт , ERR -доступ закрыт)

source: quit - exit programm
ru: quit - выход из программы

source: Format of USERNAME : domain\login, where \ is domain delimiter
ru: Формат USERNAME : домен\логин, где \ - разделитель домена и имени пользователя

source: Can not connect to the socket
ru: Невозможно создание сокета

source: Check the sqtd is started and socket file exists
ru: Проверте, запущен ли sqtd и наличие и права сокет файла

source: Return default value (can be changed with --lightmode option)
ru: Возврат значения по умолчанию (может быть изменено параметром командной строки --lightmode )

source: Responce :
ru: Ответ :

source: Query :
ru: Запрос :
